package model;

import java.util.Set;

public class FlightsInfo {

    /**
     * Конструктор принимает список рейсов
     *
     * @param flights - рейсы для которых будет отображаться информация
     */
    public FlightsInfo(Set<Flight> flights) {

    }

    /**
     * <p>Возвращает текстовое представление рейсов в формате:</p>
     * .____________________.____________________.____________________.
     * | Flight #           | Departure          | Destination        |
     * |--------------------|--------------------|--------------------|
     * | 101                | ISTANBUL           | VIENNA             |
     * | 102                | KHARKOV            | PRAGUE             |
     * |____________________|____________________|____________________|
     * <p>ширина каждого столбца - 20 смиволов не счиатая символы разделители</p>
     *
     * @return - информация о рейсах
     */
    @Override
    public String toString() {
        return null;
    }
}
